# -*- coding: utf-8 -*-
# -*- mode: org -*-
#+startup: beamer overview indent
#+LANGUAGE: pt-br
#+TAGS: noexport(n)
#+EXPORT_EXCLUDE_TAGS: noexport
#+EXPORT_SELECT_TAGS: export

#+Title: Algoritmos
#+Subtitle: *INF01202*
#+Author: Prof. Lucas Mello Schnorr
#+Date: @@latex:\copyleft@@

#+LaTeX_CLASS: beamer
#+LaTeX_CLASS_OPTIONS: [xcolor=dvipsnames]
#+OPTIONS: title:nil H:1 num:t toc:nil \n:nil @:t ::t |:t ^:t -:t f:t *:t <:t
#+LATEX_HEADER: \input{org-babel.tex}
#+LATEX_HEADER: \usepackage{amsmath}
#+LATEX_HEADER: \usepackage{systeme}

#+latex: \newcommand{\mytitle}{Revisão Aula 22}
#+latex: \mytitleslide

* (#1) Estratégia

Gerar um arquivo ~atletas.bin~:
#+begin_src shell :results output :dir e/rev-a34/ :exports both
./GeraSalva; ls -l atletas.bin
#+end_src

#+RESULTS:
: -rw-r--r-- 1 schnorr schnorr 80000004 Jun 10 08:30 atletas.bin

Lembrando do formato do arquivo
- Um inteiro (4 bytes) com a quantidade de atletas no arquivo
- Sequência de estruturas de dados com os atletas

#+latex: \vfill\pause

Passos
1. Abrir arquivo para leitura (/aka/ "r")
2. Posicionar o cabeçote no início do primeiro campo idade
3. Enquanto o arquivo não terminar
   1. Ler idade, atualizar estatísticas
   2. Ler altura, atualizar estatísticas
   3. Mover o cabeçote no início do próximo campo idade
4. Apresentar estatísticas

